Revit 2027 API
MEPSystem.ConnectorManager Property
Connector manager of the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorManager ConnectorManager { get; }
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
member ConnectorManager : ConnectorManager with get
Property Value
ConnectorManager
Remarks
The connector manager includes connectors which are used to connect with terminal elements and base equipment.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace